// Напишите программу, которая на вход принимает 
// число (N), а на выходе показывает все чётные числа от 1 до N.
for (int x = 1; x < 6; x++)       
if (x%2==0)            
Console.WriteLine(x);